7767517
105 116
Input                    in0                      0 1 in0
Convolution              conv_7                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_32                1 1 1 2 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdwrelu_0             1 1 2 3 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_0              1 2 3 4 5
Pooling                  gap_0                    1 1 5 6 0=1 4=1
Reshape                  view_71                  1 1 6 7 0=16
InnerProduct             fcrelu_0                 1 1 7 8 0=8 1=1 2=128 9=1
InnerProduct             linear_46                1 1 8 9 0=16 1=1 2=128
HardSigmoid              hsigmoid_25              1 1 9 10 0=1.666667e-01 1=5.000000e-01
Reshape                  view_72                  1 1 10 11 0=1 1=1 2=16
BinaryOp                 mul_0                    2 1 4 11 12 0=2
Convolution              conv_8                   1 1 12 13 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Convolution              convrelu_0               1 1 13 14 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 14 15 0=72 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 7=72 9=1
Convolution              conv_10                  1 1 15 16 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
Split                    splitncnn_1              1 2 16 17 18
Convolution              convrelu_1               1 1 18 19 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2112 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 19 20 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=792 7=88 9=1
Convolution              conv_12                  1 1 20 21 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2112
BinaryOp                 add_1                    2 1 17 21 22 0=0
Convolution              conv_13                  1 1 22 23 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_33                1 1 23 24 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_88                1 1 24 25 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
Split                    splitncnn_2              1 2 25 26 27
Pooling                  gap_1                    1 1 27 28 0=1 4=1
Reshape                  view_73                  1 1 28 29 0=96
InnerProduct             fcrelu_1                 1 1 29 30 0=24 1=1 2=2304 9=1
InnerProduct             linear_48                1 1 30 31 0=96 1=1 2=2304
HardSigmoid              hsigmoid_26              1 1 31 32 0=1.666667e-01 1=5.000000e-01
Reshape                  view_74                  1 1 32 33 0=1 1=1 2=96
BinaryOp                 mul_2                    2 1 26 33 34 0=2
HardSwish                hswish_34                1 1 34 35 0=1.666667e-01 1=5.000000e-01
Convolution              conv_14                  1 1 35 36 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
Split                    splitncnn_3              1 2 36 37 38
Convolution              conv_15                  1 1 38 39 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_35                1 1 39 40 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_89                1 1 40 41 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
Split                    splitncnn_4              1 2 41 42 43
Pooling                  gap_2                    1 1 43 44 0=1 4=1
Reshape                  view_75                  1 1 44 45 0=240
InnerProduct             fcrelu_2                 1 1 45 46 0=64 1=1 2=15360 9=1
InnerProduct             linear_50                1 1 46 47 0=240 1=1 2=15360
HardSigmoid              hsigmoid_27              1 1 47 48 0=1.666667e-01 1=5.000000e-01
Reshape                  view_76                  1 1 48 49 0=1 1=1 2=240
BinaryOp                 mul_3                    2 1 42 49 50 0=2
HardSwish                hswish_36                1 1 50 51 0=1.666667e-01 1=5.000000e-01
Convolution              conv_16                  1 1 51 52 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_4                    2 1 37 52 53 0=0
Split                    splitncnn_5              1 2 53 54 55
Convolution              conv_17                  1 1 55 56 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_37                1 1 56 57 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_90                1 1 57 58 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
Split                    splitncnn_6              1 2 58 59 60
Pooling                  gap_3                    1 1 60 61 0=1 4=1
Reshape                  view_77                  1 1 61 62 0=240
InnerProduct             fcrelu_3                 1 1 62 63 0=64 1=1 2=15360 9=1
InnerProduct             linear_52                1 1 63 64 0=240 1=1 2=15360
HardSigmoid              hsigmoid_28              1 1 64 65 0=1.666667e-01 1=5.000000e-01
Reshape                  view_78                  1 1 65 66 0=1 1=1 2=240
BinaryOp                 mul_5                    2 1 59 66 67 0=2
HardSwish                hswish_38                1 1 67 68 0=1.666667e-01 1=5.000000e-01
Convolution              conv_18                  1 1 68 69 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_6                    2 1 54 69 70 0=0
Convolution              conv_19                  1 1 70 71 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
HardSwish                hswish_39                1 1 71 72 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_91                1 1 72 73 0=120 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3000 7=120
Split                    splitncnn_7              1 2 73 74 75
Pooling                  gap_4                    1 1 75 76 0=1 4=1
Reshape                  view_79                  1 1 76 77 0=120
InnerProduct             fcrelu_4                 1 1 77 78 0=32 1=1 2=3840 9=1
InnerProduct             linear_54                1 1 78 79 0=120 1=1 2=3840
HardSigmoid              hsigmoid_29              1 1 79 80 0=1.666667e-01 1=5.000000e-01
Reshape                  view_80                  1 1 80 81 0=1 1=1 2=120
BinaryOp                 mul_7                    2 1 74 81 82 0=2
HardSwish                hswish_40                1 1 82 83 0=1.666667e-01 1=5.000000e-01
Convolution              conv_20                  1 1 83 84 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760
Split                    splitncnn_8              1 2 84 85 86
Convolution              conv_21                  1 1 86 87 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
HardSwish                hswish_41                1 1 87 88 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_92                1 1 88 89 0=144 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3600 7=144
Split                    splitncnn_9              1 2 89 90 91
Pooling                  gap_5                    1 1 91 92 0=1 4=1
Reshape                  view_81                  1 1 92 93 0=144
InnerProduct             fcrelu_5                 1 1 93 94 0=40 1=1 2=5760 9=1
InnerProduct             linear_56                1 1 94 95 0=144 1=1 2=5760
HardSigmoid              hsigmoid_30              1 1 95 96 0=1.666667e-01 1=5.000000e-01
Reshape                  view_82                  1 1 96 97 0=1 1=1 2=144
BinaryOp                 mul_8                    2 1 90 97 98 0=2
HardSwish                hswish_42                1 1 98 99 0=1.666667e-01 1=5.000000e-01
Convolution              conv_22                  1 1 99 100 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
BinaryOp                 add_9                    2 1 85 100 101 0=0
Convolution              conv_23                  1 1 101 102 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
HardSwish                hswish_43                1 1 102 103 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_93                1 1 103 104 0=288 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=7200 7=288
Split                    splitncnn_10             1 2 104 105 106
Pooling                  gap_6                    1 1 106 107 0=1 4=1
Reshape                  view_83                  1 1 107 108 0=288
InnerProduct             fcrelu_6                 1 1 108 109 0=72 1=1 2=20736 9=1
InnerProduct             linear_58                1 1 109 110 0=288 1=1 2=20736
HardSigmoid              hsigmoid_31              1 1 110 111 0=1.666667e-01 1=5.000000e-01
Reshape                  view_84                  1 1 111 112 0=1 1=1 2=288
BinaryOp                 mul_10                   2 1 105 112 113 0=2
HardSwish                hswish_44                1 1 113 114 0=1.666667e-01 1=5.000000e-01
Convolution              conv_24                  1 1 114 out0 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
