7767517
75 83
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 3 in0 1 2 3
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 4 in1 5 6 7 8
Crop                     slice_0                  1 1 1 9 -23310=2,6,6 -23311=2,1,2 -23309=2,2,2
Split                    splitncnn_2              1 2 9 10 11
Convolution              conv_2                   1 1 3 12 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_3                   1 1 8 13 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Reshape                  view_52                  1 1 12 14 0=64 1=96
Permute                  transpose_62             1 1 14 15 0=1
Reshape                  view_53                  1 1 13 16 0=256 1=96
MatMul                   matmul_60                2 1 15 16 17
Reshape                  view_54                  1 1 17 18 0=16 1=16 2=64
Split                    splitncnn_3              1 2 18 19 20
Pooling                  gap_0                    1 1 20 21 0=1 4=1
Convolution              convrelu_0               1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convsigmoid_2            1 1 22 23 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=4
Reshape                  reshape_50               1 1 23 24 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 19 24 25 0=2
ConvolutionDepthWise     convdwclip_0             1 1 25 26 0=64 1=2 -23310=2,0.000000e+00,6.000000e+00 11=2 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=64 9=3
Convolution              conv_6                   1 1 26 27 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_7                   1 1 2 28 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_8                   1 1 7 29 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Reshape                  view_55                  1 1 28 30 0=64 1=96
Permute                  transpose_63             1 1 30 31 0=1
Reshape                  view_56                  1 1 29 32 0=256 1=96
MatMul                   matmul_61                2 1 31 32 33
Reshape                  view_57                  1 1 33 34 0=16 1=16 2=64
Split                    splitncnn_4              1 2 34 35 36
Pooling                  gap_1                    1 1 36 37 0=1 4=1
Convolution              convrelu_1               1 1 37 38 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convsigmoid_3            1 1 38 39 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=4
Reshape                  reshape_51               1 1 39 40 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 35 40 41 0=2
ConvolutionDepthWise     convdwclip_1             1 1 41 42 0=64 1=2 -23310=2,0.000000e+00,6.000000e+00 11=2 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 7=64 9=3
Convolution              conv_11                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_12                  1 1 11 44 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_13                  1 1 6 45 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Reshape                  view_58                  1 1 44 46 0=4 1=4 11=1 2=96
ConvolutionDepthWise     convdw2d_78              2 1 45 46 47 0=96 1=4 11=4 12=1 13=1 14=1 19=1 2=1 3=1 4=1 5=0 6=1536 7=96
Convolution              conv_14                  1 1 10 48 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_15                  1 1 5 49 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Reshape                  view_59                  1 1 48 50 0=4 1=4 11=1 2=96
ConvolutionDepthWise     convdw2d_79              2 1 49 50 51 0=96 1=4 11=4 12=1 13=1 14=1 19=1 2=1 3=1 4=1 5=0 6=1536 7=96
Concat                   cat_0                    2 1 27 47 52 0=0
Convolution              conv_16                  1 1 52 53 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Concat                   cat_1                    2 1 43 51 54 0=0
Convolution              conv_17                  1 1 54 55 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
ConvolutionDepthWise     convdwclip_2             1 1 55 56 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_18                  1 1 56 57 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_3             1 1 57 58 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_19                  1 1 58 59 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_4             1 1 59 60 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_20                  1 1 60 61 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_5             1 1 61 62 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_21                  1 1 62 63 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_6             1 1 63 64 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_22                  1 1 64 65 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_7             1 1 65 66 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_23                  1 1 66 67 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_24                  1 1 67 out0 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192
ConvolutionDepthWise     convdwclip_8             1 1 53 69 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_25                  1 1 69 70 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_9             1 1 70 71 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_26                  1 1 71 72 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_10            1 1 72 73 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_27                  1 1 73 74 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_11            1 1 74 75 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_28                  1 1 75 76 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_12            1 1 76 77 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_29                  1 1 77 78 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdwclip_13            1 1 78 79 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=3
Convolution              conv_30                  1 1 79 80 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Convolution              conv_31                  1 1 80 81 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
UnaryOp                  exp_2                    1 1 81 out1 0=7
